//===================================================
//
//授業その5[main.cpp]
//Author:KishimotoEiji
//
//===================================================

//********************************
//インクルード
//********************************
#include "main.h"
#include "school.h"

#include <stdio.h>

//===================================================
//メイン関数
//===================================================
void main(void)
{
	CSchool* pSchool = CSchool::Create();	//学校を生成

	//初期化
	pSchool->Init();
	
	//行動
	pSchool->Action();

	//終了メッセージ & Enter入力待ち
	printf("\n\n プログラムを終了します。お疲れ様でした。");
	PressEnter();
}

//===================================================
//Enter入力待ち
//===================================================
void PressEnter()
{
	//Enter入力待ち
	printf("\n\n Press Enter");
	rewind(stdin);
	getchar();
}